{
    "personal": {
        "fullName": "Your Name",
        "title": "Frontend Web Developer",
        "headline": "A passionate Frontend Web Developer with 4 years of experience in creating user-friendly, visually appealing websites with a strong focus on UI/UX design.",
        "bio": [
            "I'm Nafis Mahmud Ayon, a passionate Frontend Web Developer with 4 years of experience in building responsive, high-quality websites that prioritize user experience. My expertise lies in crafting visually appealing and intuitive interfaces with a strong emphasis on UI/UX design. I enjoy turning complex problems into simple, beautiful, and engaging solutions.",
            "I thrive on the challenge of staying up-to-date with the latest technologies and best practices in the industry, ensuring that every project I work on is not only functional but also cutting-edge. Whether it's creating a mobile-first design, optimizing performance, or ensuring cross-browser compatibility, I'm committed to delivering the best possible outcome for every client.",
            "When I'm not coding, you can find me exploring new design trends, contributing to open-source projects, or sharing my knowledge with the developer community."
        ],
        "email": "nafismahmudayon@gmail.com",
        "phone": "+880 1234 567890",
        "location": "Bangladesh",
        "profileImage": "/profilePic.jpg",
        "resume": "/resume.pdf",
        "socialLinks": {
            "github": "https://github.com/NafisMahmudAyon",
            "linkedin": "https://www.linkedin.com/in/nafis-mahmud-ayon",
            "facebook": "https://www.facebook.com/ayon.nafis.mahmud",
            "twitter": "https://twitter.com/nafis_ayon_bd",
            "portfolio": "https://nafisbd.com"
        }
    },
    "skills": [
        "HTML",
        "CSS",
        "JavaScript",
        "React.js",
        "Next.js",
        "TypeScript",
        "Tailwind CSS",
        "UI/UX Design",
        "Responsive Design",
        "WordPress",
        "PHP",
        "REST API",
        "GraphQL",
        "Git",
        "Figma",
        "VS Code"
    ],
    "experience": [
        {
            "id": 1,
            "title": "AI (Computer Vision) Coop-Trainee",
            "company": "Tahakom",
            "period": "03/2025 - 06/2025",
            "location": "Riyadh, Saudi Arabia",
            "website": "tahakom.com",
            "description": "At TAHAKOM, I contributed to the development of a computer vision project, where I handled a full-scale data pipeline for a recognition model. My work involved the process of transforming approximately 100,000 surveillance images and fine-tuned the PyTorch models on a High-Performance Computing (HPC) cluster utilizing SSH for remote access and job management to efficiently train and optimize deep learning models. This work resulted in an 8% performance increase for the model. I further supported the project by conducting thorough analyzing model performance and creating reports to inform the team's strategic direction.",
            "technologies": [
                "Computer Vision",
                "PyTorch",
                "Microsoft Visual Studio Code",
                "High Performance Computing (HPC)",
                "Deep Learning",
                "OpenCV",
                "Model Fine-Tuning"
            ]
        }
    ]
}